#### Backend Terraform Plan (dev) 📖
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main_table.aws_iam_policy.table_access will be created
  + resource "aws_iam_policy" "table_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Access policy for main-dev DynamoDB table"
      + id               = (known after apply)
      + name             = "main-dev-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:PartiQLUpdate",
                          + "dynamodb:PartiQLSelect",
                          + "dynamodb:PartiQLInsert",
                          + "dynamodb:PartiQLDelete",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:ConditionCheckItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:070561229936:table/main-dev/index/*",
                          + "arn:aws:dynamodb:us-east-1:070561229936:table/main-dev",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Module"      = "dynamodb"
          + "Table"       = "main"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Module"      = "dynamodb"
          + "Repository"  = "john-matlock-eng/ai-lifestyle-app"
          + "Table"       = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dynamodb_access_policy_arn = (known after apply)
```

</details>

*Environment*: `dev`
*Triggered by*: @john-matlock-eng
*Action*: `pull_request`

**Note**: This plan will be automatically applied to the **dev** environment.